In [60]:
import pandas as pd

In [61]:
ufo = pd.read_csv('http://bit.ly/uforeports')

In [62]:
ufo.head(3)

          City Colors Reported Shape Reported State             Time
0       Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1  Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2      Holyoke             NaN           OVAL    CO  2/15/1931 14:00

In [63]:
ufo.loc[0,:]

City                       Ithaca
Colors Reported               NaN
Shape Reported           TRIANGLE
State                          NY
Time               6/1/1930 22:00
Name: 0, dtype: object

In [64]:
ufo.loc[[0,1,2],:]

          City Colors Reported Shape Reported State             Time
0       Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1  Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2      Holyoke             NaN           OVAL    CO  2/15/1931 14:00

In [65]:
ufo.loc[0:2,:]

          City Colors Reported Shape Reported State             Time
0       Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1  Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2      Holyoke             NaN           OVAL    CO  2/15/1931 14:00

In [66]:
ufo.loc[0:3]

          City Colors Reported Shape Reported State             Time
0       Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1  Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2      Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3      Abilene             NaN           DISK    KS   6/1/1931 13:00

In [67]:
ufo.loc[:, 'City'].head()

0                  Ithaca
1             Willingboro
2                 Holyoke
3                 Abilene
4    New York Worlds Fair
Name: City, dtype: object

In [68]:
ufo.loc[:, ['City', 'State']].head()

                   City State
0                Ithaca    NY
1           Willingboro    NJ
2               Holyoke    CO
3               Abilene    KS
4  New York Worlds Fair    NY

In [69]:
ufo.loc[:, 'City':'State'].head()

                   City Colors Reported Shape Reported State
0                Ithaca             NaN       TRIANGLE    NY
1           Willingboro             NaN          OTHER    NJ
2               Holyoke             NaN           OVAL    CO
3               Abilene             NaN           DISK    KS
4  New York Worlds Fair             NaN          LIGHT    NY

In [70]:
ufo.loc[0:2, 'City':'State']

          City Colors Reported Shape Reported State
0       Ithaca             NaN       TRIANGLE    NY
1  Willingboro             NaN          OTHER    NJ
2      Holyoke             NaN           OVAL    CO

In [71]:
ufo[ufo.City =='Oakland']

          City Colors Reported Shape Reported State              Time
1694   Oakland             NaN          CIGAR    CA   7/21/1968 14:00
2144   Oakland             NaN           DISK    CA    8/19/1971 0:00
4686   Oakland             NaN          LIGHT    MD     6/1/1982 0:00
7293   Oakland             NaN          LIGHT    CA   3/28/1994 17:00
8488   Oakland             NaN            NaN    CA   8/10/1995 21:45
8768   Oakland             NaN            NaN    CA  10/10/1995 22:40
10816  Oakland             NaN          LIGHT    OR   10/1/1997 21:30
10948  Oakland             NaN           DISK    CA  11/14/1997 19:55
11045  Oakland             NaN       TRIANGLE    CA   12/10/1997 1:30
12322  Oakland             NaN       FIREBALL    CA   10/9/1998 19:40
12941  Oakland             NaN       CYLINDER    CA   1/23/1999 21:30
16803  Oakland             NaN       TRIANGLE    MD    7/4/2000 23:00
17322  Oakland             NaN       CYLINDER    CA    9/1/2000 21:35

In [72]:
ufo.loc[ufo.City == 'Oakland', :]

          City Colors Reported Shape Reported State              Time
1694   Oakland             NaN          CIGAR    CA   7/21/1968 14:00
2144   Oakland             NaN           DISK    CA    8/19/1971 0:00
4686   Oakland             NaN          LIGHT    MD     6/1/1982 0:00
7293   Oakland             NaN          LIGHT    CA   3/28/1994 17:00
8488   Oakland             NaN            NaN    CA   8/10/1995 21:45
8768   Oakland             NaN            NaN    CA  10/10/1995 22:40
10816  Oakland             NaN          LIGHT    OR   10/1/1997 21:30
10948  Oakland             NaN           DISK    CA  11/14/1997 19:55
11045  Oakland             NaN       TRIANGLE    CA   12/10/1997 1:30
12322  Oakland             NaN       FIREBALL    CA   10/9/1998 19:40
12941  Oakland             NaN       CYLINDER    CA   1/23/1999 21:30
16803  Oakland             NaN       TRIANGLE    MD    7/4/2000 23:00
17322  Oakland             NaN       CYLINDER    CA    9/1/2000 21:35

In [73]:
ufo.loc[ufo.City == 'Oakland', ['State','Time']]

      State              Time
1694     CA   7/21/1968 14:00
2144     CA    8/19/1971 0:00
4686     MD     6/1/1982 0:00
7293     CA   3/28/1994 17:00
8488     CA   8/10/1995 21:45
8768     CA  10/10/1995 22:40
10816    OR   10/1/1997 21:30
10948    CA  11/14/1997 19:55
11045    CA   12/10/1997 1:30
12322    CA   10/9/1998 19:40
12941    CA   1/23/1999 21:30
16803    MD    7/4/2000 23:00
17322    CA    9/1/2000 21:35

In [74]:
ufo.iloc[0:2, :]

          City Colors Reported Shape Reported State             Time
0       Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1  Willingboro             NaN          OTHER    NJ  6/30/1930 20:00

In [75]:
ufo.iloc[0:2, [0,3]]

          City State
0       Ithaca    NY
1  Willingboro    NJ

In [76]:
ufo.iloc[0:2, 0:4]

          City Colors Reported Shape Reported State
0       Ithaca             NaN       TRIANGLE    NY
1  Willingboro             NaN          OTHER    NJ

In [77]:
range(0,2)

[0, 1]

In [78]:
ufo.iloc[0:3, :]

          City Colors Reported Shape Reported State             Time
0       Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1  Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2      Holyoke             NaN           OVAL    CO  2/15/1931 14:00

In [81]:
ufo[['City', 'State']].head()

                   City State
0                Ithaca    NY
1           Willingboro    NJ
2               Holyoke    CO
3               Abilene    KS
4  New York Worlds Fair    NY

In [82]:
ufo[0:3]

          City Colors Reported Shape Reported State             Time
0       Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1  Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2      Holyoke             NaN           OVAL    CO  2/15/1931 14:00

In [83]:
drinks = pd.read_csv('http://bit.ly/drinksbycountry', index_col = 'country')

In [84]:
drinks.head()

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
country,,,,,
Afghanistan,0,0,0,0.0,Asia
Albania,89,132,54,4.9,Europe
Algeria,25,0,14,0.7,Africa
Andorra,245,138,312,12.4,Europe
Angola,217,57,45,5.9,Africa

In [85]:
drinks.ix['Albania', 0]

89

In [86]:
drinks.ix[1, 'beer_servings']

89

In [87]:
drinks.ix['Albania':'Andorra', 0:2]

         beer_servings  spirit_servings
country
Albania             89              132
Algeria             25                0
Andorra            245              138

In [88]:
ufo.ix[0:2, 0:2]

          City Colors Reported
0       Ithaca             NaN
1  Willingboro             NaN
2      Holyoke             NaN

In [89]:
drinks['alcohol_free'] = 0
drinks.loc[drinks.total_litres_of_pure_alcohol==0, 'alcohol_free'] = 1

In [90]:
drinks.alcohol_free.value_counts()

0    180
1     13
Name: alcohol_free, dtype: int64

In [91]:
drinks[drinks.alcohol_free == 1]

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent,alcohol_free
country,,,,,,
Afghanistan,0,0,0,0.0,Asia,1
Bangladesh,0,0,0,0.0,Asia,1
North Korea,0,0,0,0.0,Asia,1
Iran,0,0,0,0.0,Asia,1
Kuwait,0,0,0,0.0,Asia,1
Libya,0,0,0,0.0,Africa,1
Maldives,0,0,0,0.0,Asia,1
Marshall Islands,0,0,0,0.0,Oceania,1
Mauritania,0,0,0,0.0,Africa,1
Monaco,0,0,0,0.0,Europe,1
Pakistan,0,0,0,0.0,Asia,1
San Marino,0,0,0,0.0,Europe,1
Somalia,0,0,0,0.0,Africa,1

In [92]:
ufo['Colors Reported'].value_counts()

RED                       780
GREEN                     531
ORANGE                    528
BLUE                      450
YELLOW                    169
RED GREEN                  89
RED BLUE                   78
RED ORANGE                 44
GREEN BLUE                 34
RED GREEN BLUE             33
ORANGE YELLOW              26
RED YELLOW                 25
ORANGE GREEN               23
YELLOW GREEN               17
ORANGE BLUE                10
RED YELLOW GREEN            9
YELLOW BLUE                 6
YELLOW GREEN BLUE           5
ORANGE GREEN BLUE           5
RED YELLOW GREEN BLUE       4
RED ORANGE YELLOW           4
RED ORANGE BLUE             3
RED ORANGE GREEN            3
RED YELLOW BLUE             3
ORANGE YELLOW BLUE          1
RED ORANGE YELLOW BLUE      1
ORANGE YELLOW GREEN         1
Name: Colors Reported, dtype: int64

In [93]:
ufo['Shape Reported'].value_counts()

LIGHT        2803
DISK         2122
TRIANGLE     1889
OTHER        1402
CIRCLE       1365
SPHERE       1054
FIREBALL     1039
OVAL          845
CIGAR         617
FORMATION     434
VARIOUS       333
RECTANGLE     303
CYLINDER      294
CHEVRON       248
DIAMOND       234
EGG           197
FLASH         188
TEARDROP      119
CONE           60
CROSS          36
DELTA           7
ROUND           2
CRESCENT        2
PYRAMID         1
DOME            1
FLARE           1
HEXAGON         1
Name: Shape Reported, dtype: int64

In [94]:
common_colors = ufo['Colors Reported'].value_counts().index[0:5]
common_shapes = ufo['Shape Reported'].value_counts().index[0:5]

In [97]:
ufo['usual']= 0
ufo['unusual']= 0

In [98]:
ufo.loc[ufo['Colors Reported'].isin(common_colors) & 
        ufo['Shape Reported'].isin(common_shapes), 
        ['usual', 'unusual']] = 1,0

In [99]:
ufo.loc[~(ufo['Colors Reported'].isin(common_colors)) | 
        ~(ufo['Shape Reported'].isin(common_shapes)), 
        ['usual', 'unusual']] = 0,1

In [100]:
ufo.head()

,City,Colors Reported,Shape Reported,State,Time,usual,unusual
0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00,0,1
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00,0,1
2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00,0,1
3,Abilene,NaN,DISK,KS,6/1/1931 13:00,0,1
4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00,0,1

In [102]:
train = pd.read_csv('http://bit.ly/kaggletrain')
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [103]:
train['Sex_num'] = train['Sex'].map({'female':0, 'male':1})

In [104]:
train.loc[0:4, ['Sex', 'Sex_num']]

      Sex  Sex_num
0    male        1
1  female        0
2  female        0
3  female        0
4    male        1

In [105]:
train['Name_len'] = train['Name'].apply(len)
train.loc[0:5, ['Name', 'Name_len']]

                                                Name  Name_len
0                            Braund, Mr. Owen Harris        23
1  Cumings, Mrs. John Bradley (Florence Briggs Th...        51
2                             Heikkinen, Miss. Laina        22
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)        44
4                           Allen, Mr. William Henry        24
5                                   Moran, Mr. James        16

In [106]:
import numpy as np

In [107]:
train['Fare_ceil'] = train['Fare'].apply(np.ceil)
train.loc[0:5, ['Fare', 'Fare_ceil']]

      Fare  Fare_ceil
0   7.2500        8.0
1  71.2833       72.0
2   7.9250        8.0
3  53.1000       54.0
4   8.0500        9.0
5   8.4583        9.0

In [108]:
train['Name'].str.split(',').head()

0                           [Braund,  Mr. Owen Harris]
1    [Cumings,  Mrs. John Bradley (Florence Briggs ...
2                            [Heikkinen,  Miss. Laina]
3      [Futrelle,  Mrs. Jacques Heath (Lily May Peel)]
4                          [Allen,  Mr. William Henry]
Name: Name, dtype: object

In [110]:
def get_list_element(mylist, position):
    return mylist[position]

In [111]:
train['Name'].str.split(',').apply(get_list_element, position = 0).head()

0       Braund
1      Cumings
2    Heikkinen
3     Futrelle
4        Allen
Name: Name, dtype: object

In [112]:
train['Last_name'] = train['Name'].str.split(',').apply(get_list_element, position = 0)
train.loc[0:5, ['Name', 'Last_name']]

                                                Name  Last_name
0                            Braund, Mr. Owen Harris     Braund
1  Cumings, Mrs. John Bradley (Florence Briggs Th...    Cumings
2                             Heikkinen, Miss. Laina  Heikkinen
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)   Futrelle
4                           Allen, Mr. William Henry      Allen
5                                   Moran, Mr. James      Moran

In [117]:
def get_last_name(name):
    first_last = name.split(',')
    last = get_list_element(first_last, 0)
    return last

In [120]:
train.drop('Last_name', axis= 1, inplace= True)

In [121]:
train['Last_name'] = train['Name'].apply(get_last_name)
train.loc[0:5, ['Name', 'Last_name']]

                                                Name  Last_name
0                            Braund, Mr. Owen Harris     Braund
1  Cumings, Mrs. John Bradley (Florence Briggs Th...    Cumings
2                             Heikkinen, Miss. Laina  Heikkinen
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)   Futrelle
4                           Allen, Mr. William Henry      Allen
5                                   Moran, Mr. James      Moran

In [122]:
train.drop('Last_name', axis= 1, inplace= True)

In [123]:
train['Last_name'] = train['Name'].str.split(',').apply(lambda x: x[0])
train.loc[0:5, ['Name', 'Last_name']]

                                                Name  Last_name
0                            Braund, Mr. Owen Harris     Braund
1  Cumings, Mrs. John Bradley (Florence Briggs Th...    Cumings
2                             Heikkinen, Miss. Laina  Heikkinen
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)   Futrelle
4                           Allen, Mr. William Henry      Allen
5                                   Moran, Mr. James      Moran

In [125]:
drinks.loc[:, 'beer_servings':'wine_servings'].head()

             beer_servings  spirit_servings  wine_servings
country
Afghanistan              0                0              0
Albania                 89              132             54
Algeria                 25                0             14
Andorra                245              138            312
Angola                 217               57             45

In [126]:
drinks.loc[:, 'beer_servings':'wine_servings'].apply(max, axis= 0)

beer_servings      376
spirit_servings    438
wine_servings      370
dtype: int64

In [127]:
drinks.loc[:, 'beer_servings':'wine_servings'].apply(max, axis = 1).head()

country
Afghanistan      0
Albania        132
Algeria         25
Andorra        312
Angola         217
dtype: int64

In [128]:
drinks.loc[:, 'beer_servings':'wine_servings'].apply(np.argmax, axis = 1).head()

country
Afghanistan      beer_servings
Albania        spirit_servings
Algeria          beer_servings
Andorra          wine_servings
Angola           beer_servings
dtype: object

In [129]:
drinks.loc[:, 'beer_servings':'wine_servings'].applymap(float).head()

             beer_servings  spirit_servings  wine_servings
country
Afghanistan            0.0              0.0            0.0
Albania               89.0            132.0           54.0
Algeria               25.0              0.0           14.0
Andorra              245.0            138.0          312.0
Angola               217.0             57.0           45.0

In [130]:
drinks.head()

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent,alcohol_free
country,,,,,,
Afghanistan,0,0,0,0.0,Asia,1
Albania,89,132,54,4.9,Europe,0
Algeria,25,0,14,0.7,Africa,0
Andorra,245,138,312,12.4,Europe,0
Angola,217,57,45,5.9,Africa,0

In [132]:
drinks.loc[:, 'beer_servings':'wine_servings'] = drinks.loc[:, 'beer_servings':'wine_servings'].applymap(float).head()

In [133]:
drinks.head()

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent,alcohol_free
country,,,,,,
Afghanistan,0.0,0.0,0.0,0.0,Asia,1
Albania,89.0,132.0,54.0,4.9,Europe,0
Algeria,25.0,0.0,14.0,0.7,Africa,0
Andorra,245.0,138.0,312.0,12.4,Europe,0
Angola,217.0,57.0,45.0,5.9,Africa,0

In [134]:
drinks.loc[:, 'beer_servings':'wine_servings'].applymap(np.floor).head()

             beer_servings  spirit_servings  wine_servings
country
Afghanistan            0.0              0.0            0.0
Albania               89.0            132.0           54.0
Algeria               25.0              0.0           14.0
Andorra              245.0            138.0          312.0
Angola               217.0             57.0           45.0